In [1]:
import pandas as pd
import numpy as np

In [13]:
df = pd.DataFrame(np.arange(5*4).reshape(5,4))

In [47]:
# you can randomly reassign rows based on random.permutation() with the number of rows to consider
sampler = np.random.permutation(4)

In [48]:
sampler

array([2, 1, 0, 3])

In [49]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [50]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [52]:
#random subset without replacement
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7

In [56]:
#random subset with replacement (so the same value may be used more than once)
choices = pd.Series([1,2,3,4,5])

In [57]:
draws = choices.sample(n=10,replace=True)

In [58]:
draws

4    5
3    4
1    2
4    5
2    3
3    4
2    3
3    4
2    3
0    1
dtype: int64

In [59]:
# versus without replacement
choices.sample(n=5)

1    2
3    4
4    5
2    3
0    1
dtype: int64

In [60]:
choices.sample(n=5,replace=True)

2    3
4    5
1    2
0    1
0    1
dtype: int64

In [64]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [65]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [67]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [68]:
pd.get_dummies(df['key'],prefix='key')

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [70]:
dummies = pd.get_dummies(df['key'],prefix='key')

In [71]:
# now merge with your original dataset
df_with_dummy=df[['data1']].join(dummies)

In [72]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [78]:
gabe = pd.DataFrame(np.arange(3*4).reshape(4,3))

In [79]:
gabe

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [92]:
reset = np.random.permutation(4)

In [93]:
gabe.take(reset)

   0   1   2
0  0   1   2
2  6   7   8
1  3   4   5
3  9  10  11

In [100]:
gabe.sample(4,replace=True)

   0   1   2
1  3   4   5
0  0   1   2
3  9  10  11
2  6   7   8

In [114]:
gabe = pd.DataFrame(np.arange(4*6).reshape(8,3))

In [117]:
gabe.sample(5)

    0   1   2
0   0   1   2
3   9  10  11
7  21  22  23
5  15  16  17
2   6   7   8

In [124]:
new_order = np.random.permutation(5)

In [130]:
gabe.take(new_order).reset_index()

   index   0   1   2
0      3   9  10  11
1      1   3   4   5
2      0   0   1   2
3      2   6   7   8
4      4  12  13  14

In [136]:
df = pd.DataFrame({'key':['a','a','b','c','a','c'],'data1':range(6)})

In [137]:
df

  key  data1
0   a      0
1   a      1
2   b      2
3   c      3
4   a      4
5   c      5

In [141]:
# converting to binary, add some key headers
pd.get_dummies(df['key'],prefix='key')

   key_a  key_b  key_c
0      1      0      0
1      1      0      0
2      0      1      0
3      0      0      1
4      1      0      0
5      0      0      1

In [142]:
gabe_dum = pd.get_dummies(df['key'],prefix='key')

In [143]:
df[['data1']].join(gabe_dum)

   data1  key_a  key_b  key_c
0      0      1      0      0
1      1      1      0      0
2      2      0      1      0
3      3      0      0      1
4      4      1      0      0
5      5      0      0      1

In [148]:
pd.concat([df['data1'],gabe_dum],axis=1)

   data1  key_a  key_b  key_c
0      0      1      0      0
1      1      1      0      0
2      2      0      1      0
3      3      0      0      1
4      4      1      0      0
5      5      0      0      1

In [150]:
df[['data1']].join(gabe_dum)

   data1  key_a  key_b  key_c
0      0      1      0      0
1      1      1      0      0
2      2      0      1      0
3      3      0      0      1
4      4      1      0      0
5      5      0      0      1

In [161]:
mnames = ['movie_id','title','genres']

In [169]:
zero_matrix = np.zeros((len(mnames),len(mnames)))

In [170]:
pd.DataFrame(zero_matrix,columns=mnames)

   movie_id  title  genres
0       0.0    0.0     0.0
1       0.0    0.0     0.0
2       0.0    0.0     0.0

In [171]:
np.random.seed(12345)

In [173]:
values = np.random.rand(10)

In [186]:
values

array([0.74771481, 0.96130674, 0.0083883 , 0.10644438, 0.29870371,
       0.65641118, 0.80981255, 0.87217591, 0.9646476 , 0.72368535])

In [176]:
bins = [0.0,0.2,0.4,0.6,0.8,1]

In [180]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1           0
1           0           0           0           0           1
2           1           0           0           0           0
3           1           0           0           0           0
4           0           1           0           0           0
5           0           0           0           1           0
6           0           0           0           0           1
7           0           0           0           0           1
8           0           0           0           0           1
9           0           0           0           1           0